# GetClosestPoint Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Alignment..::..GetClosestPoint Method
Alignment Class See Also
---
Calculates the point on the alignment's geometry which is closest to the given model point.
**Namespace:** Autodesk.Revit.DB.Infrastructure**Assembly:** Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021.1
# Syntax
C#
---
```text
public XYZ GetClosestPoint(
	XYZ point
)
```

Visual Basic
---
```text
Public Function GetClosestPoint ( _
	point As XYZ _
) As XYZ
```

Visual C++
---
```text
public:
XYZ^ GetClosestPoint(
	XYZ^ point
)
```

# ### Parameters
point
    Type: Autodesk.Revit.DB..::..XYZThe model point for which to calculate the closest point.
# ### Return Value
The alignment point closest to the given model point.
# See Also
Alignment Class
Autodesk.Revit.DB.Infrastructure Namespace